<?php
namespace app\comment\controller;

class Index
{
    public function index()
    {
        return '<style type="text/css">*{ padding: 0; margin: 0; } div{ padding: 4px 48px;} a{color:#2E5CD5;cursor: pointer;text-decoration: none} a:hover{text-decoration:underline; } body{ background: #fff; font-family: "Century Gothic","Microsoft yahei"; color: #333;font-size:18px;} h1{ font-size: 100px; font-weight: normal; margin-bottom: 12px; } p{ line-height: 1.6em; font-size: 42px }</style><div style="padding: 24px 48px;"> <h1>:)</h1><p> ThinkPHP V5<br/><span style="font-size:30px">十年磨一剑 - 为API开发设计的高性能框架</span></p><span style="font-size:22px;">[ V5.0 版本由 <a href="http://www.qiniu.com" target="qiniu">七牛云</a> 独家赞助发布 ]</span></div><script type="text/javascript" src="http://tajs.qq.com/stats?sId=9347272" charset="UTF-8"></script><script type="text/javascript" src="http://ad.topthink.com/Public/static/client.js"></script><thinkad id="ad_bd568ce7058a1091"></thinkad>';
    }

    public function test(){
        $guangdong=[
            '韶关', '广州', '江门', '梅州', '阳江', '揭阳', '汕头', '深圳', '肇庆', '河源', '中山',
            '珠海', '汕尾', '茂名', '东莞', '潮州', '佛山', '湛江', '惠州', '清远', '云浮',
        ];
        $beijing=[
            '崇文','宣武','西城','东城','海淀','朝阳', '丰台','通州','顺义','房山',
            '大兴','石景山', '昌平','怀柔','平谷','密云','门头沟','延庆'
        ];
        $tianjin=[
            '河东','蓟州','东丽','北辰', '河北','静海','河西','南开', '西青','武清','宝坻','津南', '红桥','和平','宁河','滨海新'
        ];
        $hebei=[
            '邢台','沧州','邯郸','廊坊', '秦皇岛','衡水','定州', '张家口','辛集','承德', '石家庄','唐山','保定'
        ];
        $shanxi=[
            '朔州','长治','太原', '大同','晋城','运城', '晋中','吕梁','忻州', '临汾','阳泉'
        ];
        $neimenggu=[
            '乌海','锡林郭勒盟','包头','鄂尔多斯','呼伦贝尔','通辽', '赤峰','兴安盟','阿拉善盟', '呼和浩特','乌兰察布','巴彦淖尔'
        ];
        $liaoning=[
            '本溪','铁岭','抚顺','盘锦','葫芦岛','鞍山', '沈阳','朝阳','丹东','辽阳','大连','锦州', '营口','阜新'
        ];
        $jilin=[
            '四平','吉林','松原','通化','延边朝鲜族','白山','白城','辽源','长春',
        ];
        $helongjiang=[
            '双鸭山','佳木斯','黑河','大兴安岭','伊春','哈尔滨', '鹤岗','大庆','牡丹江','鸡西','齐齐哈尔','七台河','绥化'
        ];
        $shanghai=[
            '静安','普陀','金山','松江','黄浦','嘉定','杨浦','奉贤', '虹口','闵行','宝山','青浦','长宁','徐汇','浦东新','崇明'
        ];
        $jiangsu=[
            '常州','无锡','盐城','宿迁','南通','连云港','镇江', '南京','淮安','扬州','徐州','苏州','泰州'
        ];
        $zhejiang=[
            '湖州','衢州','金华','丽水','宁波','台州', '嘉兴','舟山','绍兴','温州','杭州'
        ];
        $anhui=[
            '蚌埠','马鞍山','滁州','宣城','淮南','芜湖','安庆','六安','池州','合肥','淮北','阜阳','亳州','铜陵','巢湖','黄山','宿州'
        ];
        $fujian=[
            '三明','泉州','龙岩','莆田','福州','厦门','南平', '漳州','宁德'
        ];
        $jiangxi=[
            '景德镇','南昌','抚州','萍乡','吉安','赣州','新余','宜春','九江','鹰潭','上饶'
        ];
        $shandong=[
            '枣庄','济南','日照','临沂','菏泽','青岛','济宁','威海','德州', '东营','烟台','泰安','滨州','淄博','潍坊','莱芜','聊城'
        ];
        $henan=[
            '鹤壁','平顶山','济源','南阳','新乡','郑州','焦作','三门峡','驻马店','信阳','周口',
            '开封','濮阳','安阳','商丘','洛阳','漯河','许昌'
        ];
        $hubei=[
            '十堰','孝感','随州','咸宁','黄石','宜昌','武汉','荆门','荆州','潜江','仙桃','鄂州','襄阳','黄冈','天门','恩施土家族'
        ];
        $hunan=[
            '湘潭','岳阳','郴州','湘西土家族','怀化','张家界','衡阳','株洲','常德','永州','邵阳','长沙','益阳','娄底'
        ];
        $guangxi=[
            '北海','贵港','河池','来宾','柳州','防城港','贺州','崇左','梧州','钦州','百色','桂林','南宁','玉林'
        ];
        $hainan=[
            '三沙','儋州','澄迈县','万宁','琼中黎族','乐东黎族','文昌','东方','白沙黎族','保亭黎族',
            '琼海','三亚','临高县','昌江黎族','五指山','海口','屯昌','定安','陵水黎族'
        ];
        $chongqing=[
            '大渡口','渝中','大足','巴南','南川','江津','梁平','石柱土家族','酉阳土家族','万州','江北',
            '涪陵','九龙坡','黔江','綦江','潼南','荣昌','开州','忠县','武隆','巫溪','沙坪坝','南岸','北碚','长寿','铜梁',
            '璧山','永川','城口','丰都','垫江','云阳','奉节','巫山','彭水苗族','秀山土家族','合川','渝北'
        ];
        $sicuan=[
            '攀枝花','乐山','宜宾','德阳','内江','阿坝藏族','成都','南充','资阳','眉山','广安','广元','达州','凉山彝族',
            '自贡','巴中', '遂宁','雅安','泸州','绵阳','甘孜藏族'
        ];
        $guizhou=[
            '遵义','安顺','铜仁','黔南','毕节','六盘水','贵阳','黔西南','黔东南'
        ];
        $yunnan=[
            '丽江','曲靖','楚雄','大理','玉溪','普洱','临沧','怒江','迪庆','保山','西双版纳','文山','昭通','昆明','红河','德宏'
        ];
        $xizang=[
            '拉萨','那曲','阿里','山南','林芝','昌都','日喀则'
        ];
        $shanxi=[
            '宝鸡','咸阳','安康','铜川','商洛','渭南','榆林','延安','西安','汉中'
        ];
        $gansu=[
            '金昌','嘉峪关','陇南','临夏','平凉','张掖','定西','兰州','白银','庆阳','武威','天水','酒泉','甘南'
        ];
        $qinghai=[
            '海东','海北','果洛','海南藏族','黄南','海西','西宁','玉树'
        ];
        $ningxia=[
            '固原','中卫','银川','石嘴山','吴忠'
        ];
        $xinjiang=[
            '克拉玛依','吐鲁番','克孜勒苏柯尔克孜','阿勒泰','塔城','乌鲁木齐','喀什','阿克苏','铁门关','石河子',
            '博尔塔拉','伊犁哈萨克','昌吉','阿拉尔','图木舒克','哈密','巴音郭楞','和田','五家渠'
        ];
        $city=[
            '广东'=>['韶关', '广州','江门', '梅州', '阳江', '揭阳', '汕头', '深圳', '肇庆', '河源', '中山','珠海', '汕尾', '茂名', '东莞', '潮州', '佛山', '湛江', '惠州', '清远', '云浮'],
            '北京市'=>['崇文','宣武','西城','东城','海淀','朝阳', '丰台','通州','顺义','房山','大兴','石景山', '昌平','怀柔','平谷','密云','门头沟','延庆'],
            '天津'=>['河东','蓟州','东丽','北辰', '河北','静海','河西','南开', '西青','武清','宝坻','津南', '红桥','和平','宁河','滨海新'],
            '河北'=>['邢台','沧州','邯郸','廊坊', '秦皇岛','衡水','定州', '张家口','辛集','承德', '石家庄','唐山','保定'],
            '山西'=>['朔州','长治','太原', '大同','晋城','运城', '晋中','吕梁','忻州', '临汾','阳泉'],
            '内蒙古'=>['乌海','锡林郭勒盟','包头','鄂尔多斯','呼伦贝尔','通辽', '赤峰','兴安盟','阿拉善盟', '呼和浩特','乌兰察布','巴彦淖尔'],
            '辽宁'=>['本溪','铁岭','抚顺','盘锦','葫芦岛','鞍山', '沈阳','朝阳','丹东','辽阳','大连','锦州', '营口','阜新'],
            '吉林'=>['四平','吉林','松原','通化','延边朝鲜族','白山','白城','辽源','长春'],
            '黑龙江'=>['双鸭山','佳木斯','黑河','大兴安岭','伊春','哈尔滨', '鹤岗','大庆','牡丹江','鸡西','齐齐哈尔','七台河','绥化'],
            '上海'=>['静安','普陀','金山','松江','黄浦','嘉定','杨浦','奉贤', '虹口','闵行','宝山','青浦','长宁','徐汇','浦东新','崇明'],
            '江苏'=>['常州','无锡','盐城','宿迁','南通','连云港','镇江', '南京','淮安','扬州','徐州','苏州','泰州'],
            '浙江'=>['湖州','衢州','金华','丽水','宁波','台州', '嘉兴','舟山','绍兴','温州','杭州'],
            '安徽'=>['蚌埠','马鞍山','滁州','宣城','淮南','芜湖','安庆','六安','池州','合肥','淮北','阜阳','亳州','铜陵','巢湖','黄山','宿州'],
            '福建'=>['三明','泉州','龙岩','莆田','福州','厦门','南平', '漳州','宁德'],
            '江西'=>['景德镇','南昌','抚州','萍乡','吉安','赣州','新余','宜春','九江','鹰潭','上饶'],
            '山东'=>['枣庄','济南','日照','临沂','菏泽','青岛','济宁','威海','德州', '东营','烟台','泰安','滨州','淄博','潍坊','莱芜','聊城'],
            '河南'=>['鹤壁','平顶山','济源','南阳','新乡','郑州','焦作','三门峡','驻马店','信阳','周口','开封','濮阳','安阳','商丘','洛阳','漯河','许昌'],
            '湖北'=>['十堰','孝感','随州','咸宁','黄石','宜昌','武汉','荆门','荆州','潜江','仙桃','鄂州','襄阳','黄冈','天门','恩施土家族'],
            '湖南'=>['湘潭','岳阳','郴州','湘西土家族','怀化','张家界','衡阳','株洲','常德','永州','邵阳','长沙','益阳','娄底'],
            '广西'=>['北海','贵港','河池','来宾','柳州','防城港','贺州','崇左','梧州','钦州','百色','桂林','南宁','玉林'],
            '海南'=>['三沙','儋州','澄迈县','万宁','琼中黎族','乐东黎族','文昌','东方','白沙黎族','保亭黎族','琼海','三亚','临高县','昌江黎族','五指山','海口','屯昌','定安','陵水黎族'],
            '重庆'=>['大渡口','渝中','大足','巴南','南川','江津','梁平','石柱土家族','酉阳土家族','万州','江北', '涪陵','九龙坡','黔江','綦江','潼南','荣昌','开州','忠县','武隆','巫溪','沙坪坝','南岸','北碚','长寿','铜梁', '璧山','永川','城口','丰都','垫江','云阳','奉节','巫山','彭水苗族','秀山土家族','合川','渝北'],
            '四川'=>['攀枝花','乐山','宜宾','德阳','内江','阿坝藏族','成都','南充','资阳','眉山','广安','广元','达州','凉山彝族', '自贡','巴中', '遂宁','雅安','泸州','绵阳','甘孜藏族'],
            '贵州'=>['遵义','安顺','铜仁','黔南','毕节','六盘水','贵阳','黔西南','黔东南'],
            '云南'=>['丽江','曲靖','楚雄','大理','玉溪','普洱','临沧','怒江','迪庆','保山','西双版纳','文山','昭通','昆明','红河','德宏'],
            '西藏'=>['拉萨','那曲','阿里','山南','林芝','昌都','日喀则'],
            '陕西'=>['宝鸡','咸阳','安康','铜川','商洛','渭南','榆林','延安','西安','汉中'],
            '甘肃'=>['金昌','嘉峪关','陇南','临夏','平凉','张掖','定西','兰州','白银','庆阳','武威','天水','酒泉','甘南'],
            '青海'=>['海东','海北','果洛','海南藏族','黄南','海西','西宁','玉树'],
            '宁夏'=>['固原','中卫','银川','石嘴山','吴忠'],
            '新疆'=>['克拉玛依','吐鲁番','克孜勒苏柯尔克孜','阿勒泰','塔城','乌鲁木齐','喀什','阿克苏','铁门关','石河子','博尔塔拉','伊犁哈萨克','昌吉','阿拉尔','图木舒克','哈密','巴音郭楞','和田','五家渠']
        ];

    }
}
